FemDesign.Loads.LoadCaseType
FEM-Design Load Case Type.

FemDesign.Loads.LoadCaseType.Static
"Ordinary" load type

FemDesign.Loads.LoadCaseType.DeadLoad
"Struc. dead load" load type

FemDesign.Loads.LoadCaseType.SoilDeadLoad
"Soil dead load" load type

FemDesign.Loads.LoadCaseType.Shrinkage
"Shrinkage" load type

FemDesign.Loads.LoadCaseType.Prestressing
"Camber sim." load type

FemDesign.Loads.LoadCaseType.Fire
"Fire" load type

FemDesign.Loads.LoadCaseType.Seis_sxp
Seismic "Seis load, Fx+Mx" load type

FemDesign.Loads.LoadCaseType.Seis_sxm
Seismic "Seis load, Fx-Mx" load type

FemDesign.Loads.LoadCaseType.Seis_syp
Seismic "Seis load, Fx+My" load type

FemDesign.Loads.LoadCaseType.Seis_sym
Seismic "Seis load, Fx-My" load type

FemDesign.Loads.LoadCaseType.Deviation
(Macro generated) "Deviation" load type

FemDesign.Loads.LoadCaseType.Notional
(Macro generated) "Notional" load type

FemDesign.Loads.LoadCaseType.Seis_max
